In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame([[5,6,9],[10,13,19]])
df

    0   1   2
0   5   6   9
1  10  13  19

In [3]:
df.shape

(2, 3)

In [4]:
df.ndim

2

In [5]:
df1 = pd.DataFrame({'a':[18,19,20,19],'n':['Neha','Sneha','Rahul','Vishal']})
df1

    a       n
0  18    Neha
1  19   Sneha
2  20   Rahul
3  19  Vishal

In [6]:
df1['a']

0    18
1    19
2    20
3    19
Name: a, dtype: int64

In [7]:
df1.loc[2]

a       20
n    Rahul
Name: 2, dtype: object

In [8]:
df1[['a','n']]

    a       n
0  18    Neha
1  19   Sneha
2  20   Rahul
3  19  Vishal

In [9]:
df1[['a']]

    a
0  18
1  19
2  20
3  19

In [10]:
df1.head(2)

    a      n
0  18   Neha
1  19  Sneha

In [11]:
df1.describe()

               a
count   4.000000
mean   19.000000
std     0.816497
min    18.000000
25%    18.750000
50%    19.000000
75%    19.250000
max    20.000000

In [14]:
df1.describe(include='all')

                a     n
count    4.000000     4
unique        NaN     4
top           NaN  Neha
freq          NaN     1
mean    19.000000   NaN
std      0.816497   NaN
min     18.000000   NaN
25%     18.750000   NaN
50%     19.000000   NaN
75%     19.250000   NaN
max     20.000000   NaN

In [12]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       4 non-null      int64
 1   n       4 non-null      object
dtypes: int64(1), object(1)
memory usage: 192.0+ bytes

In [13]:
df1.value_counts()

a   n
18  Neha      1
19  Sneha     1
    Vishal    1
20  Rahul     1
dtype: int64

In [15]:
df2 = pd.read_clipboard()
df2

     name subject  marks
0    neha  python     90
1   rahul  python     92
2  apoorv  python     93
3    neha     c++     89
4   rahul     c++     88
5  apoorv     c++     94

In [16]:
df3 = pd.read_excel('file.xlsx')
df3

     name subject  marks
0    neha  python     90
1   rahul  python     92
2  apoorv  python     93
3    neha     c++     89
4   rahul     c++     88
5  apoorv     c++     94

In [17]:
df4 = pd.read_csv('file.csv')
df4

     name subject  marks
0    neha  python     90
1   rahul  python     92
2  apoorv  python     93
3    neha     c++     89
4   rahul     c++     88
5  apoorv     c++     94

In [20]:
df5 = pd.read_csv('file.txt',sep='\t')
df5

     name subject  marks
0    neha  python     90
1   rahul  python     92
2  apoorv  python     93
3    neha     c++     89
4   rahul     c++     88
5  apoorv     c++     94

In [33]:
df5 = pd.read_clipboard()

In [34]:
df5

     name subject  marks
0    neha  python     84
1   rahul  python     92
2  apoorv  python     93
3    neha     c++     89
4   rahul     c++     88
5  apoorv     c++     94

In [24]:
df5['name'][df5['marks'].idxmax()]

'apoorv'

In [30]:
df5['name'][df5['marks']==df5['marks'].max()].values[0]

'apoorv'

In [35]:
df5[df5['subject']=='c++']

     name subject  marks
3    neha     c++     89
4   rahul     c++     88
5  apoorv     c++     94

In [38]:
df5[df5['subject']=='c++']['marks'].idxmin()

4

In [36]:
df5['name'][df5[df5['subject']=='c++']['marks'].idxmin()]

'rahul'

In [39]:
df5

     name subject  marks
0    neha  python     84
1   rahul  python     92
2  apoorv  python     93
3    neha     c++     89
4   rahul     c++     88
5  apoorv     c++     94

In [42]:
df5[df5['name']=='apoorv']

     name subject  marks
2  apoorv  python     93
5  apoorv     c++     94

In [44]:
df5[['subject','marks']][df5['name']=='apoorv']

  subject  marks
2  python     93
5     c++     94

In [41]:
df5[df5['name']=='apoorv'][['subject','marks']]

  subject  marks
2  python     93
5     c++     94

In [45]:
df5['marks'][df5['name']=='neha'].mean()

86.5

In [46]:
df5.groupby('name')['marks'].mean()

name
apoorv    93.5
neha      86.5
rahul     90.0
Name: marks, dtype: float64